
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 2 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_api_management_api_diagnostic.apim_payment_api_logs
  * module.payment-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
* Update
  * azurerm_api_management_subscription.fee_pay_team_telephony_subscription
  * azurerm_api_management_subscription.pcipal_supplier_subscription
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_diagnostic.apim_payment_api_logs will be created
  + resource "azurerm_api_management_api_diagnostic" "apim_payment_api_logs" {
      + always_log_errors         = true
      + api_management_logger_id  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/loggers/cft-api-mgmt-prod-logger"
      + api_management_name       = "cft-api-mgmt-prod"
      + api_name                  = "telephony-api"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "cft-prod-network-rg"
      + sampling_percentage       = 100
      + verbosity                 = "verbose"

      + backend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + backend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }
    }

  # azurerm_api_management_subscription.fee_pay_team_telephony_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_telephony_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/7229a544-a882-4520-a81e-2cd4ed6f0031"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.pcipal_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "pcipal_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/abd7d0f5-77bc-462c-a658-c8d1e1b40837"
        # (10 unchanged attributes hidden)
    }

  # module.payment-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "4d0554dd-fe60-424a-be9c-36636826d927"
      + principal_name      = "DTS Platform Operations SC"
      + principal_type      = "Group"
      + resource_group_name = "payment-postgres-db-v15-data-prod"
      + server_name         = "payment-postgres-db-v15-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-name/538069eb70de489d8205c5a0ad2faace" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "payment-postgres-db-v15-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-name/versions/538069eb70de489d8205c5a0ad2faace" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "538069eb70de489d8205c5a0ad2faace" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-password/f75a59ed6bd147a8bb3521ec3aac8b65" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "payment-postgres-db-v15-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-password/versions/f75a59ed6bd147a8bb3521ec3aac8b65" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "f75a59ed6bd147a8bb3521ec3aac8b65" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1793,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->